In [270]:
#import statements go here:

In [271]:
from sqlalchemy import create_engine
import pymysql
import pandas as pd
from sklearn import preprocessing
import numpy as np

In [272]:
#establish a db connection, connect to it via db_connection object.

In [273]:
db_connection_str = 'mysql+pymysql://deepanalytics:Sqltask1234!@34.73.222.197/deepanalytics'

In [274]:
db_connection = create_engine(db_connection_str)

In [275]:
# now import the data from the table into a pandas dataframe 'df':

In [276]:
df = pd.read_sql('SELECT * FROM credit', con=db_connection)

In [277]:
df.head()

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default

In [278]:
# some of the attributes are stored as text. notably sex, education, and Y.
# tasks:
# 1. LIMIT_BAL: confirm LIMIT_BAL datatypes are all ints
# 2. Sex: change all 'female' to 2, change all 'male' to 1 (perform label encoding)
# 2. Education: (1 = graduate school, 2 = university, 3 = high school, 0, 4 5 6 = others)
# (perform label encoding)
# 3. Marriage: Confirm scale of 0 through 3
# 4. Age: should all be ints
# 5. PAY (repayment status): confirm scale is -2 through 9
# 6. BILL_AMT: confirm all data present
# 7. PAY_AMT (last amt paid): confirm all data present
# 8. Y (default status): change all 'default' t 0 and 'not default' to 1 (perform label encoding)

In [279]:
df.describe()

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
count,30204,30204,30204,30204,30204,30204,30204,30204,30204,30204,...,30204,30204,30204,30204,30204,30204,30204,30204,30204,30204
unique,30002,83,4,6,6,58,13,13,13,13,...,21550,21012,20606,7945,7901,7520,6939,6899,6941,4
top,ID,50000,female,university,2,29,0,0,0,0,...,0,0,0,0,0,0,0,0,0,not default
freq,2,3397,18217,14107,16088,1619,14828,15830,15863,16566,...,3218,3530,4045,5287,5437,6007,6450,6744,7233,23519

In [280]:
df = df.drop_duplicates()

In [281]:
df.describe()

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
count,30002,30002,30002,30002,30002,30002,30002,30002,30002,30002,...,30002,30002,30002,30002,30002,30002,30002,30002,30002,30002
unique,30002,83,4,6,6,58,13,13,13,13,...,21550,21012,20606,7945,7901,7520,6939,6899,6941,4
top,27895,50000,female,university,2,29,0,0,0,0,...,0,0,0,0,0,0,0,0,0,not default
freq,1,3365,18112,14030,15964,1605,14737,15730,15764,16455,...,3195,3506,4020,5249,5396,5968,6408,6703,7173,23364

In [282]:
#give columns/attributes meaningful names
df.columns = df.iloc[0]

#drop the redundant first row
df = df.drop(df.index[0])
df.describe()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
count,30001,30001,30001,30001,30001,30001,30001,30001,30001,30001,...,30001,30001,30001,30001,30001,30001,30001,30001,30001,30001
unique,30001,82,3,5,5,57,12,12,12,12,...,21549,21011,20605,7944,7900,7519,6938,6898,6940,3
top,27895,50000,female,university,2,29,0,0,0,0,...,0,0,0,0,0,0,0,0,0,not default
freq,1,3365,18112,14030,15964,1605,14737,15730,15764,16455,...,3195,3506,4020,5249,5396,5968,6408,6703,7173,23364

In [283]:
#figure out why there are so many unique values in the SEX & EDUCATION columns

In [284]:
df.SEX.unique()

array(['female', 'male', 'X2'], dtype=object)

In [285]:
df['SEX'].value_counts()

female    18112
male      11888
X2            1
Name: SEX, dtype: int64

In [286]:
df = df[df.SEX != 'X2']
df['SEX'].value_counts()

female    18112
male      11888
Name: SEX, dtype: int64

In [287]:
df.describe()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
count,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,...,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000
unique,30000,81,2,4,4,56,11,11,11,11,...,21548,21010,20604,7943,7899,7518,6937,6897,6939,2
top,27895,50000,female,university,2,29,0,0,0,0,...,0,0,0,0,0,0,0,0,0,not default
freq,1,3365,18112,14030,15964,1605,14737,15730,15764,16455,...,3195,3506,4020,5249,5396,5968,6408,6703,7173,23364

In [288]:
#check all unique values in EDUCATION
df.EDUCATION.unique()

array(['university', 'graduate school', 'high school', 'other'],
      dtype=object)

In [289]:
#check all unique values in AGE
df.AGE.unique()

array(['24', '26', '34', '37', '57', '29', '23', '28', '35', '51', '41',
       '30', '49', '39', '40', '27', '47', '33', '32', '54', '58', '22',
       '25', '31', '46', '42', '43', '45', '56', '44', '53', '38', '63',
       '36', '52', '48', '55', '60', '50', '75', '61', '73', '59', '21',
       '67', '66', '62', '70', '72', '64', '65', '71', '69', '68', '79',
       '74'], dtype=object)

In [290]:
#check all unique values in PAY_0
df.PAY_0.unique()

array(['2', '-1', '0', '-2', '1', '3', '4', '8', '7', '5', '6'],
      dtype=object)

In [291]:
# check all attribute datatypes
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30000 entries, 1 to 30203
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  object
 1   LIMIT_BAL                   30000 non-null  object
 2   SEX                         30000 non-null  object
 3   EDUCATION                   30000 non-null  object
 4   MARRIAGE                    30000 non-null  object
 5   AGE                         30000 non-null  object
 6   PAY_0                       30000 non-null  object
 7   PAY_2                       30000 non-null  object
 8   PAY_3                       30000 non-null  object
 9   PAY_4                       30000 non-null  object
 10  PAY_5                       30000 non-null  object
 11  PAY_6                       30000 non-null  object
 12  BILL_AMT1                   30000 non-null  object
 13  BILL_AMT2                   30000 non-null  object
 14  BILL_AMT3                   30000 non-null  object
 15  BILL_AMT4                   30000 non-null  object
 16  BILL_AMT5                   30000 non-null  object
 17  BILL_AMT6                   30000 non-null  object
 18  PAY_AMT1                    30000 non-null  object
 19  PAY_AMT2                    30000 non-null  object
 20  PAY_AMT3                    30000 non-null  object
 21  PAY_AMT4                    30000 non-null  object
 22  PAY_AMT5                    30000 non-null  object
 23  PAY_AMT6                    30000 non-null  object
 24  default payment next month  30000 non-null  object
dtypes: object(25)
memory usage: 6.0+ MB

In [292]:
#use label encoding to change the values in the SEX and EDUCATION columns to numerics

In [293]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30000 entries, 1 to 30203
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  object
 1   LIMIT_BAL                   30000 non-null  object
 2   SEX                         30000 non-null  object
 3   EDUCATION                   30000 non-null  object
 4   MARRIAGE                    30000 non-null  object
 5   AGE                         30000 non-null  object
 6   PAY_0                       30000 non-null  object
 7   PAY_2                       30000 non-null  object
 8   PAY_3                       30000 non-null  object
 9   PAY_4                       30000 non-null  object
 10  PAY_5                       30000 non-null  object
 11  PAY_6                       30000 non-null  object
 12  BILL_AMT1                   30000 non-null  object
 13  BILL_AMT2                   30000 non-null  object
 14  BILL_AMT3                   30000 non-null  object
 15  BILL_AMT4                   30000 non-null  object
 16  BILL_AMT5                   30000 non-null  object
 17  BILL_AMT6                   30000 non-null  object
 18  PAY_AMT1                    30000 non-null  object
 19  PAY_AMT2                    30000 non-null  object
 20  PAY_AMT3                    30000 non-null  object
 21  PAY_AMT4                    30000 non-null  object
 22  PAY_AMT5                    30000 non-null  object
 23  PAY_AMT6                    30000 non-null  object
 24  default payment next month  30000 non-null  object
dtypes: object(25)
memory usage: 6.0+ MB

In [294]:
df.describe()
df.head(10)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
5,5,50000,male,university,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default
6,6,50000,male,graduate school,2,37,0,0,0,0,...,19394,19619,20024,2500,1815,657,1000,1000,800,not default
7,7,500000,male,graduate school,2,29,0,0,0,0,...,542653,483003,473944,55000,40000,38000,20239,13750,13770,not default
8,8,100000,female,university,2,23,0,-1,-1,0,...,221,-159,567,380,601,0,581,1687,1542,not default
9,9,140000,female,high school,1,28,0,0,2,0,...,12211,11793,3719,3329,0,432,1000,1000,1000,not default
10,10,20000,male,high school,2,35,-2,-2,-2,-2,...,0,13007,13912,0,0,0,13007,1122,0,not default

In [295]:
#one-hot encode SEX column

sex_dummies = pd.get_dummies(df['SEX'], prefix='sex')
df = pd.concat([df, sex_dummies], axis=1)

df.head(10)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month,sex_female,sex_male
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,689,0,0,0,0,default,1,0
2,2,120000,female,university,2,26,-1,2,0,0,...,3261,0,1000,1000,1000,0,2000,default,1,0
3,3,90000,female,university,2,34,0,0,0,0,...,15549,1518,1500,1000,1000,1000,5000,not default,1,0
4,4,50000,female,university,1,37,0,0,0,0,...,29547,2000,2019,1200,1100,1069,1000,not default,1,0
5,5,50000,male,university,1,57,-1,0,-1,0,...,19131,2000,36681,10000,9000,689,679,not default,0,1
6,6,50000,male,graduate school,2,37,0,0,0,0,...,20024,2500,1815,657,1000,1000,800,not default,0,1
7,7,500000,male,graduate school,2,29,0,0,0,0,...,473944,55000,40000,38000,20239,13750,13770,not default,0,1
8,8,100000,female,university,2,23,0,-1,-1,0,...,567,380,601,0,581,1687,1542,not default,1,0
9,9,140000,female,high school,1,28,0,0,2,0,...,3719,3329,0,432,1000,1000,1000,not default,1,0
10,10,20000,male,high school,2,35,-2,-2,-2,-2,...,13912,0,0,0,13007,1122,0,not default,0,1

In [296]:
#one hot encode EDUCATION column

education_dummies = pd.get_dummies(df['EDUCATION'], prefix='edu')
df = pd.concat([df, education_dummies], axis=1)

df.head(10)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month,sex_female,sex_male,edu_graduate school,edu_high school,edu_other,edu_university
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,default,1,0,0,0,0,1
2,2,120000,female,university,2,26,-1,2,0,0,...,1000,0,2000,default,1,0,0,0,0,1
3,3,90000,female,university,2,34,0,0,0,0,...,1000,1000,5000,not default,1,0,0,0,0,1
4,4,50000,female,university,1,37,0,0,0,0,...,1100,1069,1000,not default,1,0,0,0,0,1
5,5,50000,male,university,1,57,-1,0,-1,0,...,9000,689,679,not default,0,1,0,0,0,1
6,6,50000,male,graduate school,2,37,0,0,0,0,...,1000,1000,800,not default,0,1,1,0,0,0
7,7,500000,male,graduate school,2,29,0,0,0,0,...,20239,13750,13770,not default,0,1,1,0,0,0
8,8,100000,female,university,2,23,0,-1,-1,0,...,581,1687,1542,not default,1,0,0,0,0,1
9,9,140000,female,high school,1,28,0,0,2,0,...,1000,1000,1000,not default,1,0,0,1,0,0
10,10,20000,male,high school,2,35,-2,-2,-2,-2,...,13007,1122,0,not default,0,1,0,1,0,0

In [297]:
#select last column (y).
y_column = df['default payment next month']

#instantiate a label encoder just for the 'y' column
le = preprocessing.LabelEncoder()

#label-encode just the y column (the [22] column)
y_column = sle.fit_transform(y_column)

#reassign values to y column
df['default payment next month'] = y_column

#check transformation
df.info()
df.head(10)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30000 entries, 1 to 30203
Data columns (total 31 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  object
 1   LIMIT_BAL                   30000 non-null  object
 2   SEX                         30000 non-null  object
 3   EDUCATION                   30000 non-null  object
 4   MARRIAGE                    30000 non-null  object
 5   AGE                         30000 non-null  object
 6   PAY_0                       30000 non-null  object
 7   PAY_2                       30000 non-null  object
 8   PAY_3                       30000 non-null  object
 9   PAY_4                       30000 non-null  object
 10  PAY_5                       30000 non-null  object
 11  PAY_6                       30000 non-null  object
 12  BILL_AMT1                   30000 non-null  object
 13  BILL_AMT2                   30000 non-null  object
 14  BILL_AMT3                   30000 non-null  object
 15  BILL_AMT4                   30000 non-null  object
 16  BILL_AMT5                   30000 non-null  object
 17  BILL_AMT6                   30000 non-null  object
 18  PAY_AMT1                    30000 non-null  object
 19  PAY_AMT2                    30000 non-null  object
 20  PAY_AMT3                    30000 non-null  object
 21  PAY_AMT4                    30000 non-null  object
 22  PAY_AMT5                    30000 non-null  object
 23  PAY_AMT6                    30000 non-null  object
 24  default payment next month  30000 non-null  int64
 25  sex_female                  30000 non-null  uint8
 26  sex_male                    30000 non-null  uint8
 27  edu_graduate school         30000 non-null  uint8
 28  edu_high school             30000 non-null  uint8
 29  edu_other                   30000 non-null  uint8
 30  edu_university              30000 non-null  uint8
dtypes: int64(1), object(24), uint8(6)
memory usage: 6.1+ MB

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month,sex_female,sex_male,edu_graduate school,edu_high school,edu_other,edu_university
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,1,0,0,0,0,1
2,2,120000,female,university,2,26,-1,2,0,0,...,1000,0,2000,0,1,0,0,0,0,1
3,3,90000,female,university,2,34,0,0,0,0,...,1000,1000,5000,1,1,0,0,0,0,1
4,4,50000,female,university,1,37,0,0,0,0,...,1100,1069,1000,1,1,0,0,0,0,1
5,5,50000,male,university,1,57,-1,0,-1,0,...,9000,689,679,1,0,1,0,0,0,1
6,6,50000,male,graduate school,2,37,0,0,0,0,...,1000,1000,800,1,0,1,1,0,0,0
7,7,500000,male,graduate school,2,29,0,0,0,0,...,20239,13750,13770,1,0,1,1,0,0,0
8,8,100000,female,university,2,23,0,-1,-1,0,...,581,1687,1542,1,1,0,0,0,0,1
9,9,140000,female,high school,1,28,0,0,2,0,...,1000,1000,1000,1,1,0,0,1,0,0
10,10,20000,male,high school,2,35,-2,-2,-2,-2,...,13007,1122,0,1,0,1,0,1,0,0

In [298]:
#give the y value a better name
df.rename(columns = {'default payment next month':'default_status', 'LIMIT_BAL':'cred_limit'}, inplace = True) 

#give the features better names
df.rename(columns = {'PAY_0':'PAY_STAT_SEP', 'PAY_2':'PAY_STAT_AUG', 'PAY_3':'PAY_STAT_JUL', 
                    'PAY_4':'PAY_STAT_JUN', 'PAY_5':'PAY_STAT_MAY', 'PAY_6':'PAY_STAT_APR'}, inplace = True)
df.rename(columns = {'BILL_AMT1':'BILL_AMTSEP', 'BILL_AMT2':'BILL_AMTAUG', 'BILL_AMT3':'BILL_AMTJUL',
                    'BILL_AMT4':'BILL_AMTJUN', 'BILL_AMT5':'BILL_AMTMAY', 'BILL_AMT6':'BILL_AMTAPR'}, inplace = True)
df.rename(columns = {'PAY_AMT1':'PAY_AMTSEP','PAY_AMT2':'PAY_AMTAUG', 'PAY_AMT3':'PAY_AMTJUL',
                     'PAY_AMT4':'PAY_AMTJUN', 'PAY_AMT5':'PAY_AMTMAY', 'PAY_AMT6':'PAY_AMTAPR'}, inplace = True)
df.columns

Index(['ID', 'cred_limit', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE',
       'PAY_STAT_SEP', 'PAY_STAT_AUG', 'PAY_STAT_JUL', 'PAY_STAT_JUN',
       'PAY_STAT_MAY', 'PAY_STAT_APR', 'BILL_AMTSEP', 'BILL_AMTAUG',
       'BILL_AMTJUL', 'BILL_AMTJUN', 'BILL_AMTMAY', 'BILL_AMTAPR',
       'PAY_AMTSEP', 'PAY_AMTAUG', 'PAY_AMTJUL', 'PAY_AMTJUN', 'PAY_AMTMAY',
       'PAY_AMTAPR', 'default_status', 'sex_female', 'sex_male',
       'edu_graduate school', 'edu_high school', 'edu_other',
       'edu_university'],
      dtype='object')

In [299]:
# select all of the object type columns 
x = df.iloc[:, 5:24] 

#make an array fo all column names
feats = x.columns

#try to make all of the object columns numeric
for feat in feats:
    try:
        x[feat] = pd.to_numeric(x[feat])
    except:
        pass
    
df.iloc[:, 5:24] = x

#manually make the first two columns numeric
df.iloc[:, 0] = pd.to_numeric(df.iloc[:, 0]);
df.iloc[:, 1] = pd.to_numeric(df.iloc[:, 1]);

#MARRIAGE feature wouldn't convert.

df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30000 entries, 1 to 30203
Data columns (total 31 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   30000 non-null  int64
 1   cred_limit           30000 non-null  int64
 2   SEX                  30000 non-null  object
 3   EDUCATION            30000 non-null  object
 4   MARRIAGE             30000 non-null  object
 5   AGE                  30000 non-null  int64
 6   PAY_STAT_SEP         30000 non-null  int64
 7   PAY_STAT_AUG         30000 non-null  int64
 8   PAY_STAT_JUL         30000 non-null  int64
 9   PAY_STAT_JUN         30000 non-null  int64
 10  PAY_STAT_MAY         30000 non-null  int64
 11  PAY_STAT_APR         30000 non-null  int64
 12  BILL_AMTSEP          30000 non-null  int64
 13  BILL_AMTAUG          30000 non-null  int64
 14  BILL_AMTJUL          30000 non-null  int64
 15  BILL_AMTJUN          30000 non-null  int64
 16  BILL_AMTMAY          30000 non-null  int64
 17  BILL_AMTAPR          30000 non-null  int64
 18  PAY_AMTSEP           30000 non-null  int64
 19  PAY_AMTAUG           30000 non-null  int64
 20  PAY_AMTJUL           30000 non-null  int64
 21  PAY_AMTJUN           30000 non-null  int64
 22  PAY_AMTMAY           30000 non-null  int64
 23  PAY_AMTAPR           30000 non-null  int64
 24  default_status       30000 non-null  int64
 25  sex_female           30000 non-null  uint8
 26  sex_male             30000 non-null  uint8
 27  edu_graduate school  30000 non-null  uint8
 28  edu_high school      30000 non-null  uint8
 29  edu_other            30000 non-null  uint8
 30  edu_university       30000 non-null  uint8
dtypes: int64(22), object(3), uint8(6)
memory usage: 6.1+ MB

,ID,cred_limit,SEX,EDUCATION,MARRIAGE,AGE,PAY_STAT_SEP,PAY_STAT_AUG,PAY_STAT_JUL,PAY_STAT_JUN,...,PAY_AMTJUN,PAY_AMTMAY,PAY_AMTAPR,default_status,sex_female,sex_male,edu_graduate school,edu_high school,edu_other,edu_university
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,1,0,0,0,0,1
2,2,120000,female,university,2,26,-1,2,0,0,...,1000,0,2000,0,1,0,0,0,0,1
3,3,90000,female,university,2,34,0,0,0,0,...,1000,1000,5000,1,1,0,0,0,0,1
4,4,50000,female,university,1,37,0,0,0,0,...,1100,1069,1000,1,1,0,0,0,0,1
5,5,50000,male,university,1,57,-1,0,-1,0,...,9000,689,679,1,0,1,0,0,0,1

In [300]:
#force the marriage column to be int64
df['MARRIAGE'] = df['MARRIAGE'].astype(int)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30000 entries, 1 to 30203
Data columns (total 31 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   30000 non-null  int64
 1   cred_limit           30000 non-null  int64
 2   SEX                  30000 non-null  object
 3   EDUCATION            30000 non-null  object
 4   MARRIAGE             30000 non-null  int64
 5   AGE                  30000 non-null  int64
 6   PAY_STAT_SEP         30000 non-null  int64
 7   PAY_STAT_AUG         30000 non-null  int64
 8   PAY_STAT_JUL         30000 non-null  int64
 9   PAY_STAT_JUN         30000 non-null  int64
 10  PAY_STAT_MAY         30000 non-null  int64
 11  PAY_STAT_APR         30000 non-null  int64
 12  BILL_AMTSEP          30000 non-null  int64
 13  BILL_AMTAUG          30000 non-null  int64
 14  BILL_AMTJUL          30000 non-null  int64
 15  BILL_AMTJUN          30000 non-null  int64
 16  BILL_AMTMAY          30000 non-null  int64
 17  BILL_AMTAPR          30000 non-null  int64
 18  PAY_AMTSEP           30000 non-null  int64
 19  PAY_AMTAUG           30000 non-null  int64
 20  PAY_AMTJUL           30000 non-null  int64
 21  PAY_AMTJUN           30000 non-null  int64
 22  PAY_AMTMAY           30000 non-null  int64
 23  PAY_AMTAPR           30000 non-null  int64
 24  default_status       30000 non-null  int64
 25  sex_female           30000 non-null  uint8
 26  sex_male             30000 non-null  uint8
 27  edu_graduate school  30000 non-null  uint8
 28  edu_high school      30000 non-null  uint8
 29  edu_other            30000 non-null  uint8
 30  edu_university       30000 non-null  uint8
dtypes: int64(23), object(2), uint8(6)
memory usage: 6.1+ MB

In [301]:
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30000 entries, 1 to 30203
Data columns (total 31 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   30000 non-null  int64
 1   cred_limit           30000 non-null  int64
 2   SEX                  30000 non-null  object
 3   EDUCATION            30000 non-null  object
 4   MARRIAGE             30000 non-null  int64
 5   AGE                  30000 non-null  int64
 6   PAY_STAT_SEP         30000 non-null  int64
 7   PAY_STAT_AUG         30000 non-null  int64
 8   PAY_STAT_JUL         30000 non-null  int64
 9   PAY_STAT_JUN         30000 non-null  int64
 10  PAY_STAT_MAY         30000 non-null  int64
 11  PAY_STAT_APR         30000 non-null  int64
 12  BILL_AMTSEP          30000 non-null  int64
 13  BILL_AMTAUG          30000 non-null  int64
 14  BILL_AMTJUL          30000 non-null  int64
 15  BILL_AMTJUN          30000 non-null  int64
 16  BILL_AMTMAY          30000 non-null  int64
 17  BILL_AMTAPR          30000 non-null  int64
 18  PAY_AMTSEP           30000 non-null  int64
 19  PAY_AMTAUG           30000 non-null  int64
 20  PAY_AMTJUL           30000 non-null  int64
 21  PAY_AMTJUN           30000 non-null  int64
 22  PAY_AMTMAY           30000 non-null  int64
 23  PAY_AMTAPR           30000 non-null  int64
 24  default_status       30000 non-null  int64
 25  sex_female           30000 non-null  uint8
 26  sex_male             30000 non-null  uint8
 27  edu_graduate school  30000 non-null  uint8
 28  edu_high school      30000 non-null  uint8
 29  edu_other            30000 non-null  uint8
 30  edu_university       30000 non-null  uint8
dtypes: int64(23), object(2), uint8(6)
memory usage: 6.1+ MB

,ID,cred_limit,SEX,EDUCATION,MARRIAGE,AGE,PAY_STAT_SEP,PAY_STAT_AUG,PAY_STAT_JUL,PAY_STAT_JUN,...,PAY_AMTJUN,PAY_AMTMAY,PAY_AMTAPR,default_status,sex_female,sex_male,edu_graduate school,edu_high school,edu_other,edu_university
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,1,0,0,0,0,1
2,2,120000,female,university,2,26,-1,2,0,0,...,1000,0,2000,0,1,0,0,0,0,1
3,3,90000,female,university,2,34,0,0,0,0,...,1000,1000,5000,1,1,0,0,0,0,1
4,4,50000,female,university,1,37,0,0,0,0,...,1100,1069,1000,1,1,0,0,0,0,1
5,5,50000,male,university,1,57,-1,0,-1,0,...,9000,689,679,1,0,1,0,0,0,1

In [304]:
df.describe()

,ID,cred_limit,MARRIAGE,AGE,PAY_STAT_SEP,PAY_STAT_AUG,PAY_STAT_JUL,PAY_STAT_JUN,PAY_STAT_MAY,PAY_STAT_APR,...,PAY_AMTJUN,PAY_AMTMAY,PAY_AMTAPR,default_status,sex_female,sex_male,edu_graduate school,edu_high school,edu_other,edu_university
count,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,...,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000
mean,15000.500000,167484.322667,1.551867,35.485500,-0.016700,-0.133767,-0.166200,-0.220667,-0.266200,-0.291100,...,4826.076867,4799.387633,5215.502567,0.778800,0.603733,0.396267,0.352833,0.163900,0.015600,0.467667
std,8660.398374,129747.661567,0.521970,9.217904,1.123802,1.197186,1.196868,1.169139,1.133187,1.149988,...,15666.159744,15278.305679,17777.465775,0.415062,0.489129,0.489129,0.477859,0.370191,0.123924,0.498962
min,1.000000,10000.000000,0.000000,21.000000,-2.000000,-2.000000,-2.000000,-2.000000,-2.000000,-2.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,7500.750000,50000.000000,1.000000,28.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,...,296.000000,252.500000,117.750000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,15000.500000,140000.000000,2.000000,34.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,1500.000000,1500.000000,1500.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,22500.250000,240000.000000,2.000000,41.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,4013.250000,4031.500000,4000.000000,1.000000,1.000000,1.000000,1.000000,0.000000,0.000000,1.000000
max,30000.000000,1000000.000000,3.000000,79.000000,8.000000,8.000000,8.000000,8.000000,8.000000,8.000000,...,621000.000000,426529.000000,528666.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000